---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PowerPerLength
source: html/e54d3653-894a-ff82-1f75-2dcf548b8f10.htm
---
# Autodesk.Revit.DB.SpecTypeId.PowerPerLength Property

Power per Length, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId PowerPerLength { get; }
```